//
//  ContactsViewController.swift
//  ContactsList
//
//  Created by Daniel Yamrak on 03.09.2021.
//

/*
 Перевіряємо чи наданий момент існує наступний флоу:
 Стартує перший раз програмка:
 1. Просимо встановити паскод
 2. Просимо підтвердити паскод
 3. 1 пункт = 2 пункти записуємо паскод у кейчейн.
 4. Просимо дозвіл на біометрику
 5. Витягуємо усі контакти з телефоної книжки
 6. Записуємо усі наші контакти у кордату


 Аплікейшен був уже встановлений:
 1. Показуємо користовачеві скрін з паскодом, поверх показуємо авторизацію з тач/фейс ід
 2. Авторизація успішна показуємо, усі контакти(контакти відображаються з кордати)
 3. Перевіряємо чи були додані нові контакти у телефоні книжці, якщо так догружаємо їх у кордату.


 ______
 При кліку на контакт переходимо на детайл контакту:
 Сторінка має показатись з низу до гори.
 існуюча сторінка усіх контактів має їхати до гори, а з низу має показуватись сторінка детайл контактів.


 при кліку на плюсик кнопочку, повинно анімовано змінюватись 4 групи контактів
 */

import UIKit

class ContactsViewController: UIViewController {

    override func viewDidLoad() {
        super.viewDidLoad()

        // setup
    }

}
